<!-- dflook/terraform-github-actions {"workspace":"kub1k","backend_type":"local","backend":"b190d6ef210ee04837d5a7477fa97147a4bf4b2abb7494bfb6b2fac3e63e8bbb","plan_job_ref":"Job Terraform Plan #67 at https://github.com/ironashram/kub1k/actions/runs/8350868997","plan_out_hash":"472b7a79f4b880b60a37e026b726b886634a84b761e0b7649fcbbb76c50f2d07","plan_hash":"bbf802221605176c8737a42cc12daedd25ef91ea8bbc1ccfed4c46f3c949ada4","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __terraform__ in the __kub1k__ workspace
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_sensitive_file" "kubeconfig" {
+       content              = (sensitive value)
+       content_base64       = (sensitive value)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       filename             = "/github/home/.kube/config-files/kub1k.yaml"
+       id                   = (known after apply)
    }

  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
-/+ resource "null_resource" "k3s_kubeconfig" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "timestamp" = "2024-03-19T22:20:17Z" -> (known after apply)
        }
    }

  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
!~  resource "vault_kv_secret_v2" "k3s" {
!~      data_json           = (sensitive value)
        id                  = "kv/data/kub1k/k3s"
        name                = "kub1k/k3s"
#        (6 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #67](https://github.com/ironashram/kub1k/actions/runs/8350868997)